#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.symbosis_my_sql_db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=4k0vyw]
random_password.db_password: Refreshing state... [id=none]
module.symbosis_my_sql_db.module.db_option_group.aws_db_option_group.this[0]: Refreshing state... [id=symbiosisdb-dev-20210801154442917800000001]
module.symbosis_my_sql_db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=symbiosisdb-dev-20210801154442919400000002]
module.fargate.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs_task_execution_role]
module.fargate.module.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:ap-southeast-1:813661051760:cluster/symbiosis-fargate]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f6d24203879696c8]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0bc1aba1b87a56689]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-0fb6c1b209427f7bc]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-055cf42fc31bf6363]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-05ebf070136c8abbd]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0df755c861a2fc51e]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-078a64106222b49c5]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-060b76adbc149b22f]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0616c973b84ee20ec]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08822dee371896487]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0a212fae540e87970]
module.fargate.aws_security_group.fargate_container_sg: Refreshing state... [id=sg-0288e27a00d7204ac]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0bce4952f15cf29e8]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0335b1d7c8a47991d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c3282502f9a61021]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0825bb260796801fa]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=symbiosis-vpc]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0dea78c2e9bb523b8]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-03e1d4b643292d184]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0b4876c1ff3e7133b]
module.alb_public.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:813661051760:loadbalancer/app/symbiosis-alb/c37f3db9a41c31ee]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-060156898172a9163]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0d9d95d688c8bc1ec]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0bce4952f15cf29e81080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cd6d6a7eb3f9a80c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0da8b24a788434417]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0da11a362b8b2280c]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-054a6c4f753ddf313]
module.symbosis_my_sql_db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=symbiosisdb-dev]
module.alb_public.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:813661051760:targetgroup/pref-20210801150302513500000004/defd95c83fc114e9]
module.alb_public.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:813661051760:listener/app/symbiosis-alb/c37f3db9a41c31ee/9aa92413e8b2cc67]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.symbosis_my_sql_db.module.db_instance.aws_db_instance.this[0] has been changed
  ~ resource "aws_db_instance" "this" {
      + enabled_cloudwatch_logs_exports       = []
        id                                    = "symbiosisdb-dev"
        name                                  = "symbiosisdb"
      + security_group_names                  = []
        tags                                  = {
            "Name" = "symbiosisdb-dev"
        }
        # (52 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.fargate.aws_security_group.fargate_container_sg has been changed
  ~ resource "aws_security_group" "fargate_container_sg" {
        id                     = "sg-0288e27a00d7204ac"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Ingress from other containers in the same security group"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Ingress from the private ALB"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Ingress from the public ALB"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
        name                   = "terraform-20210801145931738300000003"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.fargate.aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:ap-southeast-1:813661051760:cluster/symbiosis-fargate"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 75
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "symbiosis-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "symbiosis-service"
          + container_port   = 3000
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:813661051760:targetgroup/pref-20210801150302513500000004/defd95c83fc114e9"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0288e27a00d7204ac",
            ]
          + subnets          = [
              + "subnet-0335b1d7c8a47991d",
              + "subnet-0825bb260796801fa",
              + "subnet-0c3282502f9a61021",
            ]
        }
    }

  # module.fargate.aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 125
                  + image        = "logamani/symbiosis"
                  + memory       = 250
                  + name         = "symbiosis-service"
                  + portMappings = [
                      + {
                          + containerPort = 3000
                        },
                    ]
                },
            ]
        )
      + cpu                      = "125"
      + execution_role_arn       = "arn:aws:iam::813661051760:role/ecs_task_execution_role"
      + family                   = "symbiosis-service"
      + id                       = (known after apply)
      + memory                   = "125"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = {
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
    }

  # module.fargate.aws_security_group.fargate_container_sg will be updated in-place
  ~ resource "aws_security_group" "fargate_container_sg" {
        id                     = "sg-0288e27a00d7204ac"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Ingress from other containers in the same security group"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Ingress from the private ALB"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Ingress from the public ALB"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
        name                   = "terraform-20210801145931738300000003"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @logamanig, Action: `pull_request`, Working Directory: `./challenge1`, Workflow: `Terraform Plan - Dev`*